{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Flatten", "config": {"batch_input_shape": [null, 64, 64, 3], "trainable": true, "name": "flatten_1", "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "output_dim": 768, "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dtype": "float32", "input_dim": 12288, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "batch_input_shape": [null, 12288]}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": 768, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 384}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 384, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 3}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}]}